// 匹配招标人，地址，联系人，电话，电子邮件
export const STYLE_PATTER_MAP = {
  style_1:
    /招标人[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*电话[:：]\s*([\s\S]*?)\s*电子邮件[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_2:
    /招标人[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*电话[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_3:
    /招标人[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*联系方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_4:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*联系方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_5:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*电话[:：]\s*([\s\S]*?)\s*电子邮件[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_6:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*移动电话[:：]\s*([\s\S]*?)\s*邮箱[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_7:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*联系电话[:：]\s*([\s\S]*?)\s*邮箱[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

//截取 招标人 和 招标代理机构 之间的信息
export const TENDERER_PATTER_MAP = {
  style_1:
    /招标人[:：]\s*([\s\S]*?)\s*招标代理机构[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

//截取 招标代理机构 后的信息
export const TENDERER_AGENT_PATTER_MAP = {
  style_1:
    /招标代理机构[:：]\s*([\s\S]*?)\s*汇款方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_2: /招标代理机构[:：]\s*([\s\S]*?)\s*招标人\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_3: /招标代理机构[:：]\s*([\s\S]*?)\s*邮箱\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const TENDER_TIME = {
  style_1:
    /招标文件的获取获取时间[:：]\s*([\s\S]*?)\s*获取方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const DEAD_TENDER_TIME = {
  style_1:
    /投标文件的递交递交截止时间[:：]\s*([\s\S]*?)\s*递交方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const BID_OPEN_TIME = {
  style_1:
    /开标时间[:：]\s*([\s\S]*?)\s*开标地点[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const BID_OPEN_ADDRESS = {
  style_1: /开标地点[:：]\s*([\s\S]*?)\s*开标室\s*([\s\S]*?)(?=[\n\r]|$)/i,
};
