export const STYLE_PATTER_MAP = {
  // 匹配招标人，地址，联系人，电话，电子邮件
  style_1:
    /招标人[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*电话[:：]\s*([\s\S]*?)\s*电子邮件[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_2:
    /招标人[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*电话[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_3:
    /招标人[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*联系方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_4:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*联系方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_5:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*电话[:：]\s*([\s\S]*?)\s*电子邮件[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_6:
    /招标代理机构[:：]\s*([\s\S]*?)\s*地址[:：]\s*([\s\S]*?)\s*联系人[:：]\s*([\s\S]*?)\s*移动电话[:：]\s*([\s\S]*?)\s*邮箱[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const CONTACT_PATTER_MAP = {
  style_1: /联系方式[:：|\s\S]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const TENDERER_PATTER_MAP = {
  style_1:
    /招标人[:：]\s*([\s\S]*?)\s*招标代理机构[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
};

export const TENDERER_AGENT_PATTER_MAP = {
  style_1:
    /招标代理机构[:：]\s*([\s\S]*?)\s*汇款方式[:：]\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_2: /招标代理机构[:：]\s*([\s\S]*?)\s*招标人\s*([\s\S]*?)(?=[\n\r]|$)/i,
  style_3: /招标代理机构[:：]\s*([\s\S]*?)\s*邮箱\s*([\s\S]*?)(?=[\n\r]|$)/i,
};
